# <1, AUG>

# 뭔가 ㅋㅋ 깃에 일기 쓰는거 웃긴다 원래는 다이어리에 쓰기도 하지만..
# 나름 안보이게 숨겨서 쓰려고 py 타입으로 주석처리 해서 쓰는건데 나중에 공부한거 돌아보면 재밌겠다
# 모니터 와장창 부서진거 개빡쳐... 살때 원래 적어도 3년은 살려고 32인치 산거였는데 ㅠㅠ
# 이왕살꺼 이번에는 4K로 사야겠다 상여금 받으면 뭐하냐고 ㅋㅋ 다 쓰는디..

# 처음에 원래 코테 준비할떄 되게 무서웠다 2020년에도 한국에서 취준하려고 발만담궜다가 
# 스페인에 오게되면서 그냥 포기했었는데 다시 코테준비하고 이력서 쓰고 하는게 두려웠어

# 사실 지금 급여수준도 만족스러운 상태고 회사도 스트레스 없이 다니고 있으니까 굳이 옮겨야 하나 
# 라는 생각이 있었던것도 사실이지만

# 회사 2년정도 다니니까 정체기에 접어들었다는 생각도 좀 들고..
# 이왕 외국 나온거 커리어에 눈에 띌만한 스펙을 만들어야 한다는 스스로의 압박도 있었다

# 이제 막 연협 끝났으니 아직 회사 반년은 더 다니면서 이사준비, 이직준비도 해야지
# 한 1월 중하반기 부터 throw 할 생각인데.. 내년상반기에 뽀갤수 있었으면 좋겠다

# 뭔가 계속 한국 들어갈 생각때문에 스페인에서의 삶을 충분히 즐기지 못하는 것 같은 느낌도 있다.
# 항상 마음에 뭔가 공이 걸려있는 것 같은 감각?

