Sep 10

# 무엇인가 내 능력보다 약간 위의 것을 도전할때는 자신감을 잃지 않는 것이 중요하다
# 스스로의 능력과 자질을 의심하는 시기가 매일 찾아 오겠지만 지금의 현상을 유지해야한다

# 누가 그랬는데 사람들은 열심히 살고, 열심히 하지 않는다고 한다.
# 심지어는 그냥 하지 않는다
# 그래서 중요한것은 열심히 하는 것보다 그냥 하는 것이다. 
# 성인이 되어서는 도전과 발전 그리고 공부를 하지 않는 사람이 거의 대부분이라서
# 그냥 그 중 하나를 하기만 하면 성취를 이룰 수 있다고 한다

# Sep 13
# 전략을 잘 세워야할것 같다. 
# leet code난이도는 생각보다 중요하지 않고 일단 cv던져서 면접까지 가보는게 중요하다
# 이번주까지 cv준비해서 던져야지

# 23 SEP
# vall de Núria 가고 싶다 진짜 스위스 같던데 같은 피레네 산맥이라 그런가
# 사실 거긴 그냥 거의 프랑스긴 하지
# 바르셀로나로 이사가면 지로나랑 남부 프랑스는 쉽게 갈 수 있지 않을까?
# 스페인 산지 3년 다 돼가는데 아직 마드리드도 한번 못가본게 너무 웃기다,, 
# 막상 여행온 애들보다 더 못가본듯, 걔넨 세비야랑 마드리드랑 론다 이런데 다 가봤던데,,

# 운전 배워야하는데 ㅠ 여유가 너무 없다
# 자꾸 자신감 떨어진다,, 뒤로 물러날 곳이 없다는게 너무 부담스러워서 그런것 같기도 하다
#