










# <1, AUG>

# 뭔가 ㅋㅋ 깃에 일기 쓰는거 웃긴다 원래는 다이어리에 쓰기도 하지만..
# 나름 안보이게 숨겨서 쓰려고 py 타입으로 주석처리 해서 쓰는건데 나중에 공부한거 돌아보면 재밌겠다
# 모니터 와장창 부서진거 개빡쳐... 살때 원래 적어도 3년은 살려고 32인치 산거였는데 ㅠㅠ
# 이왕살꺼 이번에는 4K로 사야겠다 상여금 받으면 뭐하냐고 ㅋㅋ 다 쓰는디..

# 처음에 원래 코테 준비할떄 되게 무서웠다 2020년에도 한국에서 취준하려고 발만담궜다가 
# 스페인에 오게되면서 그냥 포기했었는데 다시 코테준비하고 이력서 쓰고 하는게 두려웠어

# 사실 지금 급여수준도 만족스러운 상태고 회사도 스트레스 없이 다니고 있으니까 굳이 옮겨야 하나 
# 라는 생각이 있었던것도 사실이지만

# 회사 2년정도 다니니까 정체기에 접어들었다는 생각도 좀 들고..
# 이왕 외국 나온거 커리어에 눈에 띌만한 스펙을 만들어야 한다는 스스로의 압박도 있었다

# 이제 막 연협 끝났으니 아직 회사 반년은 더 다니면서 이사준비, 이직준비도 해야지
# 한 1월 중하순 부터 throw 할 생각인데.. 내년상반기에 뽀갤수 있었으면 좋겠다

# 뭔가 계속 한국 들어갈 생각때문에 스페인에서의 삶을 충분히 즐기지 못하는 것 같은 느낌도 있다.
# 항상 마음에 뭔가 공이 걸려있는 것 같은 감각? 
# 그렇다고 한국에 아예 들어가버리면 ㅠㅠ 스페인 그리워서 어떻게 살아
# 너무 좋은걸.. 가족 친구 다 데려와서 여기서 살고싶다 엄마 보고싶어 ㅠㅠ
# 그냥 저녁밥 같이 차려서 먹는 그런 소소한 일상이 너무 그립다ㅠㅠ 뿌엥...
# 뿌엥.. 뿌엥... 
# 뿌엥ㅇ... ㅠㅠㅠ

# 뭔가 괴리가 있는게 친구들이나 친한 사람들한테는 이런 얘기 잘 안하니깐 외국에 산다고 신기하다고 하지만
# 집에오면 vscode에다가 일기쓰면서 뿌엥 거리고 있구..ㅋㅋ ㅠㅠ 
# 괜차나 정윤아.... 


# <2,AUG>
# 아 또 생각하니까 개빡치네 어제 라울한테 요구사항 수집하러갔는데 첨부터 끝까지 맘에 다 안든다고... ㅅㅂ...
# 아니 25년간 써온 프로그램이 바뀌면 당연히 첨엔 불편하지.. 자기가 해달라는대로 다 해줬더니 맘에 안든다고 하면 어쩌라고 뭐 ㅅㅂ..
# 나는 웹 개발 하라고 해서 하고있는데 웹 맘에 안들고 엑셀로 프로그램 만들어달란다.. 아 개빡쳐
# 한국이고 스페인이고 신의 직장은 없는듯 걍 다 개빡친다 할아버지델고 프로그램만들라니까..
# # 아 그냥 생각 안하는게 답이지 아 개빡쳐
# .
# .
# .
# 요새 깃 정리하는거 너무 재밌다 지금까지는 다 비공개 커밋이라 프로필에 초록색 안채워져서 하는 맛이 안났는데
# 코테 준비하면서 하나씩 채워가는 재미가 있다 나중에 프로필도 정리한번해야지!
# 셀카 잘 안찍으니까 프로필 사진 할게 없다 근데 또 셀카 찍으려고 기본카메라 아니고 필터씌워진거 쓰면 뭔가 어색해..
# 옛날 사진보면 소다 이런걸로 찍어서 사진예쁘게 나오긴한데 다 좀 어색하다 ㅋㅋ..
# 요새는 그냥 좀 덜 나와도 기본카메라가 나은듯! 


# <3,AUG>
# 눈뜨니까 나가야 할 시간이었다 지각하는줄 알았네
# 항상 버블티 먹을때 마다 드는 생각이지만, 한동안 안먹으면 엄청 땡기는데 먹으면 또 그만큼 맛있지는 않단말이지.. 
# 몇천원짜리 아아 테이크아웃해서 쭈우우욱 마시고싶다 ㅠ 여기는 맨날 뜨거운 커피만 마시니까 그 머리까지 얼것같은 시원함이 없어
# 하이로 남자친구 진짜 애기더라..18살이면 한국나이로 19살아니야 헤엑...
# 아직 애기티가 나던데.. 하이로는 나랑 1살차이.. 허어.... 세살 말세구만
# 근데 둘다 말투에서 너무 게이스러움 ㅋㅋㅋㅋ 앙헬 나랑 첨보는데 그 특유의 말투가 너무 웃기다 ㅋㅋ 그냥 여자애랑 말하는줄
# 하이로 잘생겨서 인기 많을듯 딱 남미 미남상
# .
# .
# 어제 M자리 문제 두개 풀어서 뿌듯! 물론 거의 구현방식이 같은거였지만 그래도 두개나 풀었다!
# 저번에 보니까 ALGO CRACK LV2. 에는 DP 도 있던데.. DP, BACKTRACKING, DFS차이를 모르겠다
# 옛날에 탐색알고리즘도 잘 모르면서 DP 풀겠다고 깝치다가 하나도 이해 못헀는데.. 이번에는 할 수 있으려나
# 어제 FAANG 도전기 블로그 포스트 보고있었는데 E :15분 M:25분 H:35분 정도 걸려야 코딩인터뷰 통과할수 있다는거 보고 너무 놀랐어
# 네? 저.. E도 몇시간 걸리는데요?.. 
# ..ㅋㅋ...
# .
# .
# 어제 진~짜 오랜만에 한식 먹었다.. 만족! 요새 제철과일이 너무 맛있어서 기분이 좋다
# 한국에 있을때는 자취생이 언감생심 과일은 꿈도 못꿨는데 여기서는 심심하면 복숭아 사먹고 수박사먹고 하니까 확실히 간식을 덜먹는다
# 집에 사둔 납작복숭아 빨리 익었으면 좋겠다.. 파인애플도 맛있던데 오늘 또 집갈때 사가야지
# 과자는 진짜 사본게 언제가 마지막이지 맥주마실때 감자칩 좀 주워먹는거 말고는 거의 안먹는거같애
# 또 자기전에 1시간정도 간단하게 요가, 스트레칭 몇달 하니까 확실히 컨디션이 다르다
# 아침에 좀만 더 일찍 일어날수 있으면 아침에도 간단하게 하고 나가고 싶은데 아침에 일찍일어나는거 너무 힘들어 ..


# <4,AUG>
# 다른 알고리즘은 한두개 풀면 그래도 어느정도 가닥도 잡히고 그러던데
# dp는 진짜 모르겠다 모 어제 시작했으니 몇개 더 풀면 낫겠지
# .
# 첨에 스페인 왔을때는 진짜 시에스타 이해 안됐는데 이제 낮잠 안자면 살수없는 몸이 되어버렸어..
# 날이 너무 더우니까 낮잠을 안자면 체력이 너무 딸린다..
# 거의 6월 부터 매일매일 40도넘게 찍으니까 살수가 없어
# 작년에는 그래도 이정도는 아니었던거 같은데 이번해는 진짜 역대급이다 미쳤어
# 길 걷다가 어질어질한적도 많고,, 뉴스보면 사람들 많이 죽는다던데 진짜 위험하다 
# 밈중에 망고나 바나나면 몰라도 사람이 살만한 날씨는 아니네요 있던데..
# 망고나 바나나도 살지 못하겠는데요,,,


# <5,AUG>
# 일상

# 일도 하기 싫고 공부도 하기싫구 오늘은 좀 무기력한날?
# 아 한달전인가 시체스 갔다온거 너무 재밌었는데 또 가고싶다

# 공부!
# dp..개어려워,,, 
# 그래도 이번주안에 ALGO CRACK LV1 단계는 끝낼수 있으니까
# 중요한 알고리즘은 한번 쓱 훑은듯! 요새 커밋 매일해서 너무 뿌듯하다!
# 다음주부터는 AMAZON 리스트랑 ALGO CRACK LV2 병행해서 커리짜면 좋을듯
# 옛날에 동땅이랑 명훈선배랑 알고 스터디한거 진짜 도움된다
# 진짜 지금 생각해도 그선배들 너무 존경스러워 특히 명훈선배 깃 보니까 몇년간 매일 커밋했던데
# 그러면서 회사도 다니고 바프도 찍고 취미로 그림도 그리고,,
# 갓생.. 나도 열심히 살아야지..


# <7,AUG>
# 게을러ㅠ 어제 너무 늦게 자고 또 몇시간 못자서 하루종일 졸리다
# 이달 말에 프라하가는거만 보고 사는중 사실 프라하도 3번째라 새롭지도 않다,,, 처음에 갈때는 언제 다시 와보겠나 했는데 벌써 세번째.. ㅎ
# 진짜 이제 여행도 재미가 없어.. 얼마전에 사촌동생이 유럽에 "큰맘"먹고 온다길래 잉? 했다 뭘 큰맘까지야,,
# 언젠가 부터 유럽-한국 일년에 두번씩은 왔다갔다하고 해외여행도 일년에 몇번씩은 다니니까
# 여행도 흥미가 없고 새롭지 않아서 좀 지루했는데
# 동생은 그 처음에 뭔가 도전할때 설렘이나 짜릿함을 아직 못느껴 본거니까.. 그게 너무 부럽더라

# 공부!
# 이번주에 dp 끝내고 싶었는데 게을러져서 못했다.
# 오늘 좀 풀고 내일 더해야지...,, 괜찮아 꾸준한게 중요한거지!
# 


# <8,AUG>
# 저번주 엄청 기분 안좋았는데 이유 알아냄 ㅋㅋㅋ... : 호르몬
# 어쩐지 염증도 많이 생기더라,,,. 어제 막 블로그 어쩌고 다이어리 어쩌고 한거 쑥스럽네,,ㅋㅋ
# 약먹으니까 바로 좋아지더라 ㅋㅋ 
# 어제 기분 안좋아서 누구한테 전화해서 하소연했으면 진짜 부끄러울뻔했어,,ㅋㅋ ㅠㅠ
# 
# 아침마다 들리는 저택에 고양이 보면서 출근하는게 하루 낙인데 요즘 안보이더라
# 까만고양이 애기 두마리 낳았던데 징챠기여워 ㅠㅠㅠ 아직 애기들이라 조심성이 없어서 막 의자나 테이블 위에서 낮잠자는거 기여워 ㅠㅠ
# 빨리 여름 지났으면 좋겠다 염색하고 싶어서 여름지나기만을 기다리는중! 오랜만에 흑발해야지!
# 
# 사실 요새 계속 타투도안보고있다,, 절대 안할거라고 다짐하고 도안만 보는중!
# .. 안할꺼야,, 하고싶지만 안할꺼야,,... 
# 하지만 진짜 쪼그만거는 괜찮지 않을까? 새끼손톱만한 쪼그만 타투는 괜찮지 않을까?...
# 
# 오늘 bit manipulation 공부시작!
# 이건 처음 해보는 거라 신기하다


# <9,AUG>

# 대체적으로 bit manipulation / bit operation은 그냥 easy로 많이 나오는듯
# 어제 시작했는데 lv1 bit manipulation 끝냈다
# 코드 인터뷰할때 완전 답을 최적으로 맞추는것 보다 설명하면서 생각의 flow를 계속 중얼중얼 설명하듯이 하는게 중요하다고 함
# 이제 풀때 주석 + 생각정리 설명하듯이 계속 말하면서 풀기
# 시간도 체크!해가면서 easy는 이제 후딱 할 수 있는듯
# 
# 기현이가 자기 코테 준비할때 했던 깃 보여주고 설명해준거 너무 도움된다! 나도 파이썬으로 하니까 훨씬 편한듯
# 기현이 너무 착해 진짜,, 넘 고맙다 또 나름 챙겨준다고 자기 정리해둔 인터뷰 질문도 주고 ㅠㅠ 감동이야
# 학교다닐때 그렇게 유약해 보일수가 없었는데 뭔가 ㅋㅋ 자기 앞가림 하고 딱 열심히 한거 보니까 멋지다 나도 열심히해야지..
# 공부법 같은거도 공유해줘서 따라하니까 좋았던거 같다. 나는 뭔가 답 보면 안된다고 생각하고 질질 끌었는데 (그래서 algo crack lv1 초반에 못풀고 넘어간 문제가 많다)
# 그냥 시간 정해놓고 못풀면 답지보고 넘어가는것도 괜찮은듯
# 일단 문제 무조건 많이풀어보는게 답인것 같다 약간 수능때 기출공부 계속 돌리듯이
# 
# 계획 
# 아직 algo crack lv1 초반에 넘어간 문제들이 남아있긴하지만 메이저 알고리즘은 한번쓱 훑은것 같다
# 이제 본격적으로 기출 문제 + algo crack lv2 섞어서 해야할듯
# 하루에 2문제정도 도전.. 해보고 안되면 한문제씩이라도 꾸준하게 해야할것같다
# algo crack 은 알고리즘 유형 익숙해지게 하는데 집중
# 기출 : 문제보는눈 (어떤 알고리즘 써야할지) + 기업별 코딩 인터뷰 경향 파악 이런느낌으로
# 생각보다 기출 적중률이 높으니까 이것만 많이 돌려도 합격률 많이 올라간다.. 고함

# 지원할 회사도 슬 봐야하는데,, 원래는 아마존 1순위였는데 진짜 극악의 워라밸이라고하더라,,
# 내년에 이사갈거 생각하면 또 너무 머리아파,, 마드리드보다는 바르셀로나에 살고싶은데 보통 오퍼가 마드리드에 있더라 ㅠ
# 웬만한 빅테크는 다 워라밸 망했다던데 한국에서 너무 과대평가 된듯..
# 200K 씩 미국에서 받는 엔지니어들도 그렇게 많이 받는거 아니라던데 living cost보니까 장난아니긴하더라,,


# <10,AUG>
# 아 어제 잔다고 약속 못나갔다,, ㅋㅋ.. ㅠ 요새 낮잠을 무슨 두세시간씩 자니까 패턴 다꼬였어 
# 요새 느끼는 거지만 나진짜 자존심 센 사람들이랑 안맞는듯,, 뭔가 너무 꼿꼿한 사람들한테는 잘해주고 싶지가 않아 딱 눈에는눈 이에는이,,
# 유들한 사람한테는 다 지고들어가도 하나도 안 기분 나쁘고 오히려 더 잘해주고싶은데
# 따지고보면 친구들중에 성격세고 자존심센사람 없는듯 다 물렁물렁한 애들이야
# 또 애들 생각하니까 귀엽네,, 다들 어쩜 두부같이 착하고 온순한지 ㅠ ㄱㅇㅇ ㅠㅠ
# 동네가면 애들 볼 수 있었음 좋겠다.. 이제 몇명 안남았던데ㅠㅠ 다 이사가고 취업하고 하니까 동네에 친구가 없다 이제

# 다시 binary search 부터 medium 단계 풀고 있는데 답지 볼때 마다 속상하다 ㅠ 이렇게 계속 답지 봐서 실력이 늘까 싶기도하고
# 안볼려고 노력하지만 일단 한정된 시간안에 많이 푸는게 목표니까.. 일단 해보고 실력 정체오면 풀었던 문제 다시 푸는 방식으로 공부하자
# medium 하루 두문제씩 풀려고 하면 진짜 시간 투자 많이해야되더라 진짜 하루종일 풀어야돼
# 8월에는 그래도 시간 많이 투자해놔야 9월 10월에 공부 못하는거 커버할수 있으니까 미리 해놓자
# 공부는 하면 할수록 부족한거 계속 느끼는듯 ㅈㅇㅇ ㅎㅇㅌ..

# 아 살짝 상처받았어,, 
# 인스타 끊어야겠다..



# <11,AUG>
# 인터뷰 시간 45분. 
# 인터뷰 내내 대화가 끊기지 않도록 연습 --> 커뮤니케이션 역량 강조

# <12,AUG>
# 결국 병원행 ㅋㅋ
# 다음주 화요일 피검사 
# 요즘 듣는 노래 : manila / double take
# hard문제는 어렵다.. 하루 두문제 푸는거 너무 벅차 이번주에 진짜 leetcode 만하고 살았던거같다
# 이번달까지만 2문제 하고 좀 줄이던가 해야지 시간 투자가 너무 많다 ㅠ
# 오늘 진짜 오랜만에 pau랑 jairo랑 수영장 가기로했다 올해 자유형은 뽀개겠어
# 거의 1년만에 보는거같아 내 첫 플랫메이트 
# 진짜 스페인적응하는데 pau가 많이 도와줬던거 같다 오랜만에 회포풀어야지 ㅋㅋ
# 하이로 남자친구도 올려나.. 요새 맨날 붙어다니던데