>>> bin(0b1 << 1)
'0b10'
>>> bin(0b1 << 2)
'0b100'
>>> bin(0b1 << 3)
'0b1000'
위에서 1이 점점 왼쪽으로 이동하는 것을 볼 수 있습니다.

다음은 오른쪽 시프트(>>)입니다.

>>> bin(0b1010 >> 1)
'0b101'
1이 오른쪽으로 한 자리씩 밀린 것을 볼 수 있습니다. 더 많이 시프트하면 어떻게 될까요?

>>> bin(0b1010 >> 2)
'0b10'
>>> bin(0b1010 >> 3)
'0b1'
>>> bin(0b1010 >> 4)
'0b0'
점점 밀려서 결국 0이 되었네요.











# <1, AUG>

# 뭔가 ㅋㅋ 깃에 일기 쓰는거 웃긴다 원래는 다이어리에 쓰기도 하지만..
# 나름 안보이게 숨겨서 쓰려고 py 타입으로 주석처리 해서 쓰는건데 나중에 공부한거 돌아보면 재밌겠다
# 모니터 와장창 부서진거 개빡쳐... 살때 원래 적어도 3년은 살려고 32인치 산거였는데 ㅠㅠ
# 이왕살꺼 이번에는 4K로 사야겠다 상여금 받으면 뭐하냐고 ㅋㅋ 다 쓰는디..

# 처음에 원래 코테 준비할떄 되게 무서웠다 2020년에도 한국에서 취준하려고 발만담궜다가 
# 스페인에 오게되면서 그냥 포기했었는데 다시 코테준비하고 이력서 쓰고 하는게 두려웠어

# 사실 지금 급여수준도 만족스러운 상태고 회사도 스트레스 없이 다니고 있으니까 굳이 옮겨야 하나 
# 라는 생각이 있었던것도 사실이지만

# 회사 2년정도 다니니까 정체기에 접어들었다는 생각도 좀 들고..
# 이왕 외국 나온거 커리어에 눈에 띌만한 스펙을 만들어야 한다는 스스로의 압박도 있었다

# 이제 막 연협 끝났으니 아직 회사 반년은 더 다니면서 이사준비, 이직준비도 해야지
# 한 1월 중하순 부터 throw 할 생각인데.. 내년상반기에 뽀갤수 있었으면 좋겠다

# 뭔가 계속 한국 들어갈 생각때문에 스페인에서의 삶을 충분히 즐기지 못하는 것 같은 느낌도 있다.
# 항상 마음에 뭔가 공이 걸려있는 것 같은 감각? 
# 그렇다고 한국에 아예 들어가버리면 ㅠㅠ 스페인 그리워서 어떻게 살아
# 너무 좋은걸.. 가족 친구 다 데려와서 여기서 살고싶다 엄마 보고싶어 ㅠㅠ
# 그냥 저녁밥 같이 차려서 먹는 그런 소소한 일상이 너무 그립다ㅠㅠ 뿌엥...
# 뿌엥.. 뿌엥... 
# 뿌엥ㅇ... ㅠㅠㅠ

# 뭔가 괴리가 있는게 친구들이나 친한 사람들한테는 이런 얘기 잘 안하니깐 외국에 산다고 신기하다고 하지만
# 집에오면 vscode에다가 일기쓰면서 뿌엥 거리고 있구..ㅋㅋ ㅠㅠ 
# 괜차나 정윤아.... 


# <2,AUG>
# 아 또 생각하니까 개빡치네 어제 라울한테 요구사항 수집하러갔는데 첨부터 끝까지 맘에 다 안든다고... ㅅㅂ...
# 아니 25년간 써온 프로그램이 바뀌면 당연히 첨엔 불편하지.. 자기가 해달라는대로 다 해줬더니 맘에 안든다고 하면 어쩌라고 뭐 ㅅㅂ..
# 나는 웹 개발 하라고 해서 하고있는데 웹 맘에 안들고 엑셀로 프로그램 만들어달란다.. 아 개빡쳐
# 한국이고 스페인이고 신의 직장은 없는듯 걍 다 개빡친다 할아버지델고 프로그램만들라니까..
# # 아 그냥 생각 안하는게 답이지 아 개빡쳐
# .
# .
# .
# 요새 깃 정리하는거 너무 재밌다 지금까지는 다 비공개 커밋이라 프로필에 초록색 안채워져서 하는 맛이 안났는데
# 코테 준비하면서 하나씩 채워가는 재미가 있다 나중에 프로필도 정리한번해야지!
# 셀카 잘 안찍으니까 프로필 사진 할게 없다 근데 또 셀카 찍으려고 기본카메라 아니고 필터씌워진거 쓰면 뭔가 어색해..
# 옛날 사진보면 소다 이런걸로 찍어서 사진예쁘게 나오긴한데 다 좀 어색하다 ㅋㅋ..
# 요새는 그냥 좀 덜 나와도 기본카메라가 나은듯! 


# <3,AUG>
# 눈뜨니까 나가야 할 시간이었다 지각하는줄 알았네
# 항상 버블티 먹을때 마다 드는 생각이지만, 한동안 안먹으면 엄청 땡기는데 먹으면 또 그만큼 맛있지는 않단말이지.. 
# 몇천원짜리 아아 테이크아웃해서 쭈우우욱 마시고싶다 ㅠ 여기는 맨날 뜨거운 커피만 마시니까 그 머리까지 얼것같은 시원함이 없어
# 하이로 남자친구 진짜 애기더라..18살이면 한국나이로 19살아니야 헤엑...
# 아직 애기티가 나던데.. 하이로는 나랑 1살차이.. 허어.... 세살 말세구만
# 근데 둘다 말투에서 너무 게이스러움 ㅋㅋㅋㅋ 앙헬 나랑 첨보는데 그 특유의 말투가 너무 웃기다 ㅋㅋ 그냥 여자애랑 말하는줄
# 하이로 잘생겨서 인기 많을듯 딱 남미 미남상
# .
# .
# 어제 M자리 문제 두개 풀어서 뿌듯! 물론 거의 구현방식이 같은거였지만 그래도 두개나 풀었다!
# 저번에 보니까 ALGO CRACK LV2. 에는 DP 도 있던데.. DP, BACKTRACKING, DFS차이를 모르겠다
# 옛날에 탐색알고리즘도 잘 모르면서 DP 풀겠다고 깝치다가 하나도 이해 못헀는데.. 이번에는 할 수 있으려나
# 어제 FAANG 도전기 블로그 포스트 보고있었는데 E :15분 M:25분 H:35분 정도 걸려야 코딩인터뷰 통과할수 있다는거 보고 너무 놀랐어
# 네? 저.. E도 몇시간 걸리는데요?.. 
# ..ㅋㅋ...
# .
# .
# 어제 진~짜 오랜만에 한식 먹었다.. 만족! 요새 제철과일이 너무 맛있어서 기분이 좋다
# 한국에 있을때는 자취생이 언감생심 과일은 꿈도 못꿨는데 여기서는 심심하면 복숭아 사먹고 수박사먹고 하니까 확실히 간식을 덜먹는다
# 집에 사둔 납작복숭아 빨리 익었으면 좋겠다.. 파인애플도 맛있던데 오늘 또 집갈때 사가야지
# 과자는 진짜 사본게 언제가 마지막이지 맥주마실때 감자칩 좀 주워먹는거 말고는 거의 안먹는거같애
# 또 자기전에 1시간정도 간단하게 요가, 스트레칭 몇달 하니까 확실히 컨디션이 다르다
# 아침에 좀만 더 일찍 일어날수 있으면 아침에도 간단하게 하고 나가고 싶은데 아침에 일찍일어나는거 너무 힘들어 ..


# <4,AUG>
# 다른 알고리즘은 한두개 풀면 그래도 어느정도 가닥도 잡히고 그러던데
# dp는 진짜 모르겠다 모 어제 시작했으니 몇개 더 풀면 낫겠지
# .
# 첨에 스페인 왔을때는 진짜 시에스타 이해 안됐는데 이제 낮잠 안자면 살수없는 몸이 되어버렸어..
# 날이 너무 더우니까 낮잠을 안자면 체력이 너무 딸린다..
# 거의 6월 부터 매일매일 40도넘게 찍으니까 살수가 없어
# 작년에는 그래도 이정도는 아니었던거 같은데 이번해는 진짜 역대급이다 미쳤어
# 길 걷다가 어질어질한적도 많고,, 뉴스보면 사람들 많이 죽는다던데 진짜 위험하다 
# 밈중에 망고나 바나나면 몰라도 사람이 살만한 날씨는 아니네요 있던데..
# 망고나 바나나도 살지 못하겠는데요,,,


# <5,AUG>
# 일상

# 일도 하기 싫고 공부도 하기싫구 오늘은 좀 무기력한날?
# 아 한달전인가 시체스 갔다온거 너무 재밌었는데 또 가고싶다
# 좀 힘든일 있으면 그날 생각이 나는데 처음으로 시체스에 간날 
# 처음으로 왔을때 세상에서 처음 느껴본만큼의 행복을 느껴서 진짜 여기가 천국이구나 이런생각이 들었었다
# 외국인으로 살아서 majority에 속하지 못한다는 열등감이 있었다. 근데 거긴 진짜 다양성이 존중받는 곳이니까. 오히려 마음이 편했어
# 다시는 스페인에 올 날이 없을줄 알고 교환학생 마무리 할겸 거의 마지막 여행으로 들렸던 곳이었는데
# 막상 걸으면서 무조건 다시 돌아오겠다고 생각했었지
# 추억,,
# 
# 그 언저리부터 석사 밟을 생각하고 교수한테 컨택하기 시작해서
# 결국 한 6개월인가 7개월 후에 코로나에도 불구하고 돌아왔었지
# 그때 예이다까지 오는 renfe도 없어서 rodalies를 탔는데, 나보다 큰 캐리어 두개를 끌고 3시간짜리 해안열차를 타는게 너무 지치고 피곤했어
# 마침 해질녁이라 돌아오는길에 노을이랑 다시 시체스 해안가 보고나서 그때 바로 다이어리 펴서 일기 쓰기 시작했다
# 다시 오길 잘했다고
# 
# 얼마전에 20년도 다이어리 발견해서 읽어봤는데, 나 진짜 마음고생 많이 했구나 싶더라  불쌍해
# 지금 생각해도 그때는 진짜 위태위태해 보였는데
# 거의 한달은 벌벌떨면서 살았던거 같다 잠도 못자고 밥도 못먹고ㅋㅋ 별 후회되는 짓들은 다하고 돌아다녔지ㅎ
# 웃긴건 운동하면 불안하고 극단적인 사고 완화에 도움이 된다는걸 어디서 들었었어
# 막 새벽에 공원가서 울면서 뛰었던거 ㅋㅋ 진짜 혼자 훌쩍훌쩍 거리면서 뛰고,,
# 뛰다가 숨은 찬데 울긴 울어야 겠어서 엉엉 헉헉,, 엉엉,, 
# 여름이라 진짜 더웠는데 땀 한바가지 쏟고 눈물도 한바가지 쏟고 ㅋㅋ
# ㅋㅋ 누가 봤으면 진짜 무서웠겠다
# 그래도 그때 나으려고 노력한게 갸륵한데? 의지 대단 ㅋㅋ 맨날 아침저녁으로 뛰고 쓰러져서라도 잘려고 ㅋㅋ
# 지금은 운동으로 하라고 해도 못할듯..

# 공부!
# dp..개어려워,,, 
# 그래도 이번주안에 ALGO CRACK LV1 단계는 끝낼수 있으니까
# 중요한 알고리즘은 한번 쓱 훑은듯! 요새 커밋 매일해서 너무 뿌듯하다!
# 다음주부터는 AMAZON 리스트랑 ALGO CRACK LV2 병행해서 커리짜면 좋을듯
# 옛날에 동땅이랑 명훈선배랑 알고 스터디한거 진짜 도움된다
# 진짜 지금 생각해도 그선배들 너무 존경스러워 특히 명훈선배 깃 보니까 몇년간 매일 커밋했던데
# 그러면서 회사도 다니고 바프도 찍고 취미로 그림도 그리고,,
# 갓생.. 나도 열심히 살아야지..


# <7,AUG>
# 게을러ㅠ 어제 너무 늦게 자고 또 몇시간 못자서 하루종일 졸리다
# 이달 말에 프라하가는거만 보고 사는중 사실 프라하도 3번째라 새롭지도 않다,,, 처음에 갈때는 언제 다시 와보겠나 했는데 벌써 세번째.. ㅎ
# 진짜 이제 여행도 재미가 없어.. 얼마전에 사촌동생이 유럽에 "큰맘"먹고 온다길래 잉? 했다 뭘 큰맘까지야,,
# 언젠가 부터 유럽-한국 일년에 두번씩은 왔다갔다하고 해외여행도 일년에 몇번씩은 다니니까
# 여행도 흥미가 없고 새롭지 않아서 좀 지루했는데
# 동생은 그 처음에 뭔가 도전할때 설렘이나 짜릿함을 아직 못느껴 본거니까.. 그게 너무 부럽더라

# 요즘 딱 노잼시기라고 하나 그런게 온거같아
# 진짜 sns는 믿을게 못되는게 항상 행복해보이는 사진만 올리니까 다 좋아보이지
# 얼마전에 셜록현준 그 교수님 인스타 소개말에도 보이는것과 실제는 다르다는 말을 올려놨더라고
# 그거 보면서.. 아 사람생각하는거 다 똑같다 싶기도 하고 ㅎ
# 내 인스타만 봐도 진짜 다 유럽여행한거, 맨날 친구들이랑 노는거 이런건데
# 그건진짜 가끔이고 맨날 회사-집-회사-집 퇴근하면 코테풀고 이게 다니깐,,

# 내 생각에는 내 또래에 비해서는 이것저것 해본 경험이 많다고 생각했는데
# 그래서 그런지 항상 안정감에 대해 목마른 느낌이 있다 경험쌓느라 가족이랑 안정감은 뒷전으로 뒀으니
# 좀 한군데서 몇년씩 살고 미래에 대해 그려가면서 하나씩 갖춰나가는 느낌이 있었으면 하는데
# 현실은 맨날 이사하고 나라도,도시도 바뀌고 가족이랑은 진짜 일년에 한번씩 아니면 두번씩 보니까
# 답답하기도 하고 심리적으로 정착을 못하니까 내 집이 어딘가 싶다
# 진짜 이거 감정쓰레기통이네 ㅋㅋ.. 누구한테 얘기하느니 여기다 쓰는게 낫지머

# 고등학생때 잠깐 혼자 쓰던 블로그에 썼던 포스트 다시봤다
# 혼돈의 고3이었지,, ㅋㅋㅋ 그때 수시쓸때 돼서 한두달 간격으로 상을 두번이나 치르고 거진 집안 풍비박산 났으니까 ㅋㅋㅋ...
# 그때 고3말 대1초까지 진짜 장례 3번 치렀던거 같다.. 지금 생각해도 엄마아빠 진짜 힘들었겠다 싶어
# 그래서 엄마아빠도 나 대학가는거 거의 신경 못썼던거 같다 ㅋㅋ 그건 고민 축에도 못드는 거였으니까 그땐
# 진짜 그래서 고등학생때 기억이 별로 없나 싶다 너무 스트레스를 받아서
# 그때 막 누구한테 말 못하고 블로그에 이것저것 내뱉어 놨었는데 오랜만에 보니까 거기에 누가 응원댓글을 달아놨었더라
# 힘내라고 ㅋㅋ 나쁜생각 하지 말라고 했었나? 그거 보니까 진짜 눈물이 찡했어
# 누군지도 모르는 사람한테 응원 받은지도 몰랐는데 그런 기록이 남아있으니까 ㅎ ..
# 시간 지나면 별로 상처도 고민도 아닌것들인데 당시에는 너무 크게 와닿는게 많은것같아
# 지금도 그런시간중에 하나일 거라고 생각하면서!
# 담에 이거 읽으면 그냥 그랬었지 하면서 웃고 넘길수 있었으면 좋겠다.

# 공부!
# 이번주에 dp 끝내고 싶었는데 게을러져서 못했다.
# 오늘 좀 풀고 내일 더해야지...,, 괜찮아 꾸준한게 중요한거지!
# 


# <8,AUG>
# 저번주 엄청 기분 안좋았는데 이유 알아냄 ㅋㅋㅋ... : 호르몬
# 어쩐지 염증도 많이 생기더라,,,. 어제 막 블로그 어쩌고 다이어리 어쩌고 한거 쑥스럽네,,ㅋㅋ
# 약먹으니까 바로 좋아지더라 ㅋㅋ 
# 어제 기분 안좋아서 누구한테 전화해서 하소연했으면 진짜 부끄러울뻔했어,,ㅋㅋ ㅠㅠ
# 
# 아침마다 들리는 저택에 고양이 보면서 출근하는게 하루 낙인데 요즘 안보이더라
# 까만고양이 애기 두마리 낳았던데 징챠기여워 ㅠㅠㅠ 아직 애기들이라 조심성이 없어서 막 의자나 테이블 위에서 낮잠자는거 기여워 ㅠㅠ
# 빨리 여름 지났으면 좋겠다 염색하고 싶어서 여름지나기만을 기다리는중! 오랜만에 흑발해야지!
# 
# 사실 요새 계속 타투도안보고있다,, 절대 안할거라고 다짐하고 도안만 보는중!
# .. 안할꺼야,, 하고싶지만 안할꺼야,,... 
# 하지만 진짜 쪼그만거는 괜찮지 않을까? 새끼손톱만한 쪼그만 타투는 괜찮지 않을까?...
# 
# 오늘 bit manipulation 공부시작!
# 이건 처음 해보는 거라 신기하다
